---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.ReverseIterator
source: html/9c2689ac-51fc-7f8f-a18e-d4f7ee3e161e.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SymbolicCurveArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.